examples/stefanProblem/stefanProblem/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 253.15;

boundaryField
{
    upperWall
    {
	type            zeroGradient;
    }
    rightWall
    {
	type            zeroGradient;
    }
    lowerWall
    {
      type		zeroGradient;
      //  type            fixedValue;
      //value           uniform 303.15;
    }
    leftWall
    {
        type            fixedValue;
	value           uniform 293.15;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
